Case_0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

l1 $l11;
a $aa;
rd $rdd;
lc $lcc;

lc1 #eval{$lc/2};
lc2 #eval{$lc/2};
lc3 #eval{$lc/2};
z1 #eval{-$a};
z2 #eval{$l1 -4*$rd};
z3 #eval{$l1 + $a + 4*$rd};
z4 #eval{2*$l1 + 2*$a};



vertices
(
    (0.0145 0.0145 $z1)           
    (-0.0145 0.0145 $z1)          
    (0.0145 -0.0145 $z1)           
    (-0.0145 -0.0145 $z1)          
    (0.0145 0.0145 $z2)           
    (-0.0145 0.0145 $z2)          
    (0.0145 -0.0145 $z2)           
    (-0.0145 -0.0145 $z2)
    (0.0145 0.0145 $z3)           
    (-0.0145 0.0145 $z3)          
    (0.0145 -0.0145 $z3)           
    (-0.0145 -0.0145 $z3)
    (0.0145 0.0145 $z4)           
    (-0.0145 0.0145 $z4)          
    (0.0145 -0.0145 $z4)           
    (-0.0145 -0.0145 $z4)
);

blocks
(
  hex (0 1 3 2 4 5 7 6) (25 25 $lc1) simpleGrading (1 1 1)
  hex (4 5 7 6 8 9 11 10) (25 25 $lc2) simpleGrading (1 1 1)
  hex (8 9 11 10 12 13 15 14) (25 25 $lc3) simpleGrading (1 1 1)
);

