Case_0/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-4; // Ajusta según sea necesario

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-4; // Ajusta según sea necesario
    }
    outlet
    {
        type            zeroGradient;
    }
    wall_inlet
    {
        type            fixedValue; 
        value           uniform 0;
    }
    wall_outlet
    {
        type            fixedValue; 
        value           uniform 0;
    }
    plate_inlet
    {
        type            fixedValue; 
        value           uniform 0;
    }
    plate_outlet
    {
        type            fixedValue; 
        value           uniform 0;
    }
    porous
    {
        type            fixedValue; 
        value           uniform 0;
    }
}



// ************************************************************************* //
